# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32
 # - [39.95,38.50, 88.11,81.84, 96.05,107.49]
  - [110.72,91.81, 122.39,115.13, 215.01,194.64]

# YOLOv5 backbone
backbone:
  # MobileNetV3-large
  # [from, number, module, args]                                      1,3,640,640
  [[-1, 1, Conv3BN, [16, 2]],                          # 0-p1/2        1,8,320,320
   [-1, 1, MobileNetv3, [ 16,  16, 3, 1, 0, 0]],  # 1-p1/2              1,8,320,320
   [-1, 1, MobileNetv3, [ 24,  64, 3, 2, 0, 0]],  # 2-p2/4             1,24,160,160
   [-1, 1, MobileNetv3, [ 24,  72, 3, 1, 0, 0]],  # 3-p2/4             1,24,160,160
   #   [-1, 1, SE,          [24,2]],
   [-1, 1, MobileNetv3, [ 40,  72, 5, 2, 1, 0]],  # 4-p3/8             1,24,80,80
   [-1, 1, MobileNetv3, [ 40, 120, 5, 1, 1, 0]],  # 5-p3/8              1,24,80,80
   [-1, 1, MobileNetv3, [ 40, 120, 5, 1, 1, 0]],  # 6-p3/8              1,24,80,80
   [-1, 1, MobileNetv3, [ 80, 240, 3, 2, 0, 1]],  # 7-p4/16           1,40,40,40
   [-1, 1, MobileNetv3, [ 80, 200, 3, 1, 0, 1]],  # 8-p4/16           1,40,40,40
   [-1, 1, MobileNetv3, [ 80, 184, 3, 1, 0, 1]],  # 9-p4/16           1,40,40,40
   [-1, 1, MobileNetv3, [ 80, 184, 3, 1, 0, 1]],  # 10-p4/16          1,40,40,40
   [-1, 1, MobileNetv3, [112, 480, 3, 1, 1, 1]],  # 11-p4/16          1,56,40,40
   [-1, 1, MobileNetv3, [112, 672, 3, 1, 1, 1]],  # 12-p4/16          1,56,40,40
   [-1, 1, MobileNetv3, [160, 672, 5, 1, 1, 1]],  # 13-p4/16          1,80,40,40
   [-1, 1, MobileNetv3, [160, 672, 5, 2, 1, 1]],  # 14-p5/32          1,80,20,20
   [-1, 1, MobileNetv3, [160, 960, 5, 1, 1, 1]],  # 15-p5/32          1,80,20,20
       [-1, 1, SPPF, [1024, 5]],  # 9    1    16  80 80
  ]

# YOLOv5 head
head:
  # v2
#  [ [ 6, 1, Conv, [ 128, 1, 1 ] ], # 16
#    [ 13, 1, Conv, [ 256, 1, 1 ] ], # 17
#
#    [ [ 16, 17 ], 1, ASFF_2, [ 128, 0 ] ], # 18
#    [ [ 16, 17 ], 1, ASFF_2, [ 256, 1 ] ], # 19
#
#    [ -2, 1, DWConv, [ 128,  1, 1  ] ], # 20
#    [ -2, 1, DWConv, [ 256,  1, 1  ] ], # 21
#
#    [ 15, 1, Conv, [ 512, 1, 1 ] ], # 22
#
#    [ [ 20, 21, 22 ], 1, ASFF_3, [ 128, 0 ] ], # 23
#    [ [ 20, 21, 22 ], 1, ASFF_3, [ 256, 1 ] ], # 24
##    [ [  20, 21, 22 ], 1, ASFF_3, [ 512, 2 ] ], # 25
#
#    [ 23, 1, DWConv, [ 128,  1, 1  ] ],
#    [ 24, 1, DWConv, [ 256,  1, 1  ] ],
#     [ [ -1,-2 ], 1, Detect, [ 3, anchors ] ], # nc=3
#
#
#    ]

  [ [ 6, 1, Conv, [ 128, 1, 1 ] ], # 16
    [ 13, 1, Conv, [ 256, 1, 1 ] ], # 17

    [ [ 17, 18 ], 1, ASFF_2, [ 128, 0 ] ], # 18
    [ [ 17, 18 ], 1, ASFF_2, [ 256, 1 ] ], # 19

    [ -2, 1, DWConv, [ 128,  1, 1  ] ], # 20
    [ -2, 1, DWConv, [ 256,  1, 1  ] ], # 21

    [ 16, 1, Conv, [ 512, 1, 1 ] ], # 22

    [ [ 21, 22, 23 ], 1, ASFF_3, [ 128, 0 ] ], # 23
    [ [ 21, 22, 23 ], 1, ASFF_3, [ 256, 1 ] ], # 24
#    [ [  20, 21, 22 ], 1, ASFF_3, [ 512, 2 ] ], # 25

    [ 24, 1, DWConv, [ 128,  1, 1  ] ],
    [ 25, 1, DWConv, [ 256,  1, 1  ] ],
     [ [ -1,-2 ], 1, Detect, [ 3, anchors ] ], # nc=3


    ]
#  [
#    [ -1, 1, Conv, [ 112, 1,1 ] ],  # 9         1,56   15  20          1,56,20,20
#    [ -1, 1, DWConv, [ 24, 1, 1 ] ],        #       1,24,15  20            1,80,20,20?
#    [ 15, 1, Interpolate, [ 80, None, 4, 'bilinear', True ] ],   # 30 40
#    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40    [1,80,80,80] [1,24,80,80]=[1,104,80,80]
#    [ -1, 1, Conv, [ 112, 1,1 ] ], # 12            # 30 40
#    [ -1, 1, DWConv, [ 24, 1, 1 ] ],                   #30 40
#
#    [ [ -5,-1 ], 1, Detect, [ 3, anchors ] ], # nc=3
#  ]




#  [[-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 13], 1, Concat, [1]],  # cat backbone P4
#   [-1, 1, C3, [256, False]],  # 19
#
#   [-1, 1, Conv, [128, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
#   [-1, 1, C3, [128, False]],  # 23 (P3/8-small)
#
#   [-1, 1, Conv, [128, 3, 2]],
#   [[-1, 20], 1, Concat, [1]],  # cat head P4
#   [-1, 1, C3, [256, False]],  # 26 (P4/16-medium)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 16], 1, Concat, [1]],  # cat head P5
#   [-1, 1, C3, [512, False]],  # 29 (P5/32-large)
#
#   [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]

