# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32
 # - [39.95,38.50, 88.11,81.84, 96.05,107.49]
  - [110.72,91.81, 122.39,115.13, 215.01,194.64]

# YOLOv5 backbone
backbone:
  # MobileNetV3-large
  # [from, number, module, args]                                      1,3,640,640

  [[ -1, 1, conv_bn_relu_maxpool, [ 32 ] ], # 0-P2/4                  1,8,160,160
   [ -1, 1, Shuffle_Block, [ 128, 2 ] ],  # 1-P3/8                    1,32,80,80
   [ -1, 3, Shuffle_Block, [ 128, 1 ] ],  # 2                          1,32,80,80

   [ -1, 1, Shuffle_Block, [ 256, 2 ] ],  # 3-P4/16
   [ -1, 7, Shuffle_Block, [ 256, 1 ] ],  # 4
   [ -1, 1, Shuffle_Block, [ 512, 2 ] ],  # 5-P5/32
   [ -1, 3, Shuffle_Block, [ 512, 1 ] ],  # 6
#      [ -1, 1, SE,            [ 512, 2]  ],  #
    [-1, 1, SPPF, [1024, 5]],  #
  ]


# YOLOv5 head
head:

#  [ [ 2, 1, Conv, [ 128, 1, 1 ] ], # 7
#    [ 4, 1, Conv, [ 256, 1, 1 ] ], # 8
#
#    [ [ 9, 10 ], 1, ASFF_2, [ 128, 0 ] ], # 9
#    [ [ 9, 10 ], 1, ASFF_2, [ 256, 1 ] ], # 10
#
#    [ -2, 1, DWConv, [ 128,  1, 1 ] ], # 11
#    [ -2, 1, DWConv, [ 256,  1, 1 ] ], # 12
#
#    [ 8, 1, Conv, [ 512, 1, 1 ] ], # 13
#
#    [ [ 13, 14, 15 ], 1, ASFF_3, [ 128, 0 ] ], # 14
#    [ [ 13, 14, 15 ], 1, ASFF_3, [ 256, 1 ] ], # 15
#
#    [ 16, 1, DWConv, [ 128,  1, 1 ] ],
#    [ 17, 1, DWConv, [ 256,  1, 1 ] ],
#    [ [ -1,-2 ], 1, Detect, [ 3, anchors ] ], # nc=3
#  ]
  # v2
  [ [ 2, 1, Conv, [ 128, 1, 1 ] ], # 7
    [ 4, 1, Conv, [ 256, 1, 1 ] ], # 8

    [ [ 8, 9 ], 1, ASFF_2, [ 128, 0 ] ], # 9
    [ [ 8, 9 ], 1, ASFF_2, [ 256, 1 ] ], # 10

    [ -2, 1, DWConv, [ 128,  1, 1  ] ], # 11
    [ -2, 1, DWConv, [ 256,  1, 1  ] ], # 12

    [ 7, 1, Conv, [ 512, 1, 1 ] ], # 13

    [ [ 12, 13, 14 ], 1, ASFF_3, [ 128, 0 ] ], # 14
    [ [ 12, 13, 14 ], 1, ASFF_3, [ 256, 1 ] ], # 15

    [ 15, 1, DWConv, [ 128,  1, 1  ] ],
    [ 16, 1, DWConv, [ 256,  1, 1  ] ],
     [ [ -1,-2 ], 1, Detect, [ 3, anchors ] ], # nc=3
    ]

#  [
#    [ -1, 1, Conv, [ 112, 1,1 ] ],  # 9         1,56   15  20          1,56,20,20
#    [ -1, 1, DWConv, [ 24, 1, 1 ] ],        #       1,24,15  20            1,80,20,20?
#    [ 15, 1, Interpolate, [ 80, None, 4, 'bilinear', True ] ],   # 30 40
#    [ [ -1, 6 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40    [1,80,80,80] [1,24,80,80]=[1,104,80,80]
#    [ -1, 1, Conv, [ 112, 1,1 ] ], # 12            # 30 40
#    [ -1, 1, DWConv, [ 24, 1, 1 ] ],                   #30 40
#
#    [ [ -5,-1 ], 1, Detect, [ 3, anchors ] ], # nc=3
#  ]




#  [[-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 13], 1, Concat, [1]],  # cat backbone P4
#   [-1, 1, C3, [256, False]],  # 19
#
#   [-1, 1, Conv, [128, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 6], 1, Concat, [1]],  # cat backbone P3
#   [-1, 1, C3, [128, False]],  # 23 (P3/8-small)
#
#   [-1, 1, Conv, [128, 3, 2]],
#   [[-1, 20], 1, Concat, [1]],  # cat head P4
#   [-1, 1, C3, [256, False]],  # 26 (P4/16-medium)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 16], 1, Concat, [1]],  # cat head P5
#   [-1, 1, C3, [512, False]],  # 29 (P5/32-large)
#
#   [[23, 26, 29], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]

