# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
#WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW
#BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB
#YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY
#基于Yolo-Fastest V2，其中backbone部分用MobileNetV2特征提取部分替换ShuffleNetV2
# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32
#  - [39.95,38.50, 88.11,81.84, 96.05,107.49]
  - [110.72,91.81, 122.39,115.13, 215.01,194.64]

# YOLOv5 v6.0 backbone
backbone:

  [                                                 # 480 640
   [-1, 1, MobileNetV3, [24,1]],    #0-P3/8       1,24,    60  80
   [-1, 1, MobileNetV3, [48,2]],    # 1-P4/16     1,48    30  40
   [-1, 1, MobileNetV3, [576,3]],     # 2-P5/32   1,576    15  20
  ]
## 更加细致的方式
#  [[-1, 1, conv_bn_hswish, [16, 2]],             # 0-p1/2   320*320
#   [-1, 1, MobileNetV3, [16,  16, 3, 2, 1, 0]],  # 1-p2/4   160*160
#   [-1, 1, MobileNetV3, [24,  72, 3, 2, 0, 0]],  # 2-p3/8   80*80
#   [-1, 1, MobileNetV3, [24,  88, 3, 1, 0, 0]],  # 3        80*80
#   [-1, 1, MobileNetV3, [40,  96, 5, 2, 1, 1]],  # 4-p4/16  40*40
#   [-1, 1, MobileNetV3, [40, 240, 5, 1, 1, 1]],  # 5        40*40
#   [-1, 1, MobileNetV3, [40, 240, 5, 1, 1, 1]],  # 6        40*40
#   [-1, 1, MobileNetV3, [48, 120, 5, 1, 1, 1]],  # 7        40*40
#   [-1, 1, MobileNetV3, [48, 144, 5, 1, 1, 1]],  # 8        40*40
#   [-1, 1, MobileNetV3, [96, 288, 5, 2, 1, 1]],  # 9-p5/32  20*20
#   [-1, 1, MobileNetV3, [96, 576, 5, 1, 1, 1]],  # 10       20*20
#   [-1, 1, MobileNetV3, [96, 576, 5, 1, 1, 1]],  # 11       20*20
#  ]
## v4-v1head
#    [[-1, 1, conv_bn_relu_maxpool, [3]],    # 0-P2/4
#     [-1, 1, ShuffleNetV2_InvertedResidual, [128, 2]], # 1-P3/8
#     [-1, 3, ShuffleNetV2_InvertedResidual, [128, 1]], # 2
#     [-1, 1, ShuffleNetV2_InvertedResidual, [256, 2]], # 3-P4/16
#     [-1, 7, ShuffleNetV2_InvertedResidual, [256, 1]], # 4
#     [-1, 1, ShuffleNetV2_InvertedResidual, [512, 2]], # 5-P5/32
#     [-1, 3, ShuffleNetV2_InvertedResidual, [512, 1]], # 6
#    ]


# YOLOv5 v6.0 head
head:
#  [ [ -1, 1, Conv, [ 512, 1, 1 ] ],
#    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#    [ [ -1, 1 ], 1, Concat, [ 1 ] ],  # cat backbone P4
#    [ -1, 3, C3, [ 512, False ] ],  # 13
#
#    [ -1, 1, Conv, [ 256, 1, 1 ] ],
#    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#    [ [ -1, 0 ], 1, Concat, [ 1 ] ],  # cat backbone P3
#    [ -1, 3, C3, [ 256, False ] ],  # 17 (P3/8-small)
#
#    [ -1, 1, Conv, [ 256, 3, 2 ] ],
#    [ [ -1, 7 ], 1, Concat, [ 1 ] ],  # cat head P4
#    [ -1, 3, C3, [ 512, False ] ],  # 20 (P4/16-medium)
#
#    [ -1, 1, Conv, [ 512, 3, 2 ] ],
#    [ [ -1, 3 ], 1, Concat, [ 1 ] ],  # cat head P5
#    [ -1, 3, C3, [ 1024, False ] ],  # 23 (P5/32-large)
#
#    [ [ 10, 13, 16 ], 1, Detect, [ nc, anchors ] ],  # Detect(P3, P4, P5)
#  ]


# V1
#  [
#    [ -1, 1, DWConv, [ 112, 1,1 ] ],  # 9         1,56   15  20
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],        #       1,24,15  20
#    [2, 1, Interpolate, [576, None, 2, 'bilinear', True]],   # 30 40
#    [ [ -1, 1 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40    [1,576,40,40] [1,48,40,40]=[1,624,40,40]
#    [ -1, 1, DWConv, [ 112, 1,1 ] ], # 12            # 30 40
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                   #30 40
#
#    [[-5,-1], 1, Detect, [3, anchors]], # nc=3
#  ]
  [
    [ -1, 1, DWConv, [ 112, 1,1 ] ],  # 9         1,56   15  20
    [ -1, 1, Conv, [ 24, 1, 1 ] ],        #       1,24,15  20
    [2, 1, Interpolate, [576, None, 4, 'bilinear', True]],   # 30 40
    [ [ -1, 0 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40    [1,576,40,40] [1,48,40,40]=[1,624,40,40]
    [ -1, 1, DWConv, [ 112, 1,1 ] ], # 12            # 30 40
    [ -1, 1, Conv, [ 24, 1, 1 ] ],                   #30 40

    [[-5,-1], 1, Detect, [3, anchors]], # nc=3
  ]
# V2在上一版的基础上将一条支路抬高一级
#  [
#    [ -1, 1, DWConv, [ 112, 1,1 ] ],  # 9         1,56   15  20
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],        #       1,24,15  20
#    [11, 1, Interpolate, [576, None, 4, 'bilinear', True]],   # 30 40
#    [ [ -1, 3 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40    [1,576,40,40] [1,48,40,40]=[1,624,40,40]
#    [ -1, 1, DWConv, [ 112, 1,1 ] ], # 12            # 30 40
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                   #30 40
#
#    [[-5,-1], 1, Detect, [3, anchors]], # nc=3
#  ]

# V2
#相比于上一版，这版用DWConvblock替换了DWConv
#注意！！！！！这里的DWConvblock可能有错误，用它训练得到的结果准确率几乎为0.
#  [
#    [ -1, 1, DWConvblock, [ 112, 1 ] ],  # 9            15  20
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                  #15  20
#    [2, 1, Interpolate, [576, None, 2, 'bilinear', True]],   # 30 40
#    [ [ -1, 1 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40
#    [ -1, 1, DWConvblock, [ 112, 1 ] ], # 12            # 30 40
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                   #30 40
#
#    [[-5,-1], 1, Detect, [3, anchors]], # nc=3
#  ]y

# v3
##相比于上一版，这版引入了注意力机制
#  [
#    [ -1, 1, DWConvblock, [ 112, 1 ] ],  # 9            15  20
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                  #15  20
#    [2, 1, Interpolate, [576, None, 2, 'bilinear', True]],   # 30 40
#    [ [ -1, 1 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40
#    [ -1, 1, DWConvblock, [ 112, 1 ] ], # 12            # 30 40
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                   #30 40
#
#    [[-5,-1], 1, Detect, [3, anchors]], # nc=3
#  ]
##

## v4
#  [
#    [ -1, 1, DWConv, [ 112, 1,1 ] ],  # 9            15  20
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                  #15  20
#    [6, 1, Interpolate, [576, None, 2, 'bilinear', True]],   # 30 40
#    [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # 11 (PAN-like) # 30 40
#    [ -1, 1, DWConv, [ 112, 1,1 ] ], # 12            # 30 40
#    [ -1, 1, Conv, [ 24, 1, 1 ] ],                   #30 40
#
#    [[-5,-1], 1, Detect, [3, anchors]], # nc=3
#  ]

