# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32
#  - [39.95,38.50, 88.11,81.84, 96.05,107.49]
  - [110.72,91.81, 122.39,115.13, 215.01,194.64]

# YOLOv5 backbone
backbone:
  # MobileNetV3-large
  # [from, number, module, args]                                      1,3,640,640

  [[ -1, 1, conv_bn_relu_maxpool, [ 32 ] ], # 0-P2/4                  1,8,160,160
   [ -1, 1, Shuffle_Block, [ 128, 2 ] ],  # 1-P3/8                    1,32,80,80
   [ -1, 3, Shuffle_Block, [ 128, 1 ] ],  # 2                          1,32,80,80

   [ -1, 1, Shuffle_Block, [ 256, 2 ] ],  # 3-P4/16
   [ -1, 7, Shuffle_Block, [ 256, 1 ] ],  # 4
   [ -1, 1, Shuffle_Block, [ 512, 2 ] ],  # 5-P5/32
   [ -1, 3, Shuffle_Block, [ 512, 1 ] ],  # 6
#      [ -1, 1, SE,            [ 512, 2]  ],  #
    [-1, 1, SPPF, [1024, 5]],  #7
  ]

# YOLOv5 head
head:

  [
    [ 2, 1, Conv, [ 128, 1, 1 ] ], # 9
#    [ -1, 1, CBAM,            [ 32]  ],
    [ 4, 1, Conv, [ 256, 1, 1 ] ], # 11
#    [ -1, 1, CBAM,            [ 64]  ],

    [ [ 8, 9 ], 1, ASFF_2, [ 128, 0 ] ], # 12
    [ [ 8, 9 ], 1, ASFF_2, [ 256, 1 ] ], # 13

    [ -2, 1, DWConv, [ 128,  1, 1  ] ], # 14
    [ -2, 1, DWConv, [ 256,  1, 1  ] ], # 15

    [ 7, 1, Conv, [ 512, 1, 1 ] ], # 16
#        [ -1, 1, CBAM,            [ 128]  ],

    [ [ 12, 13, 14 ], 1, ASFF_3, [ 128, 0 ] ], # 17
    [ [ 12, 13, 14 ], 1, ASFF_3, [ 256, 1 ] ], # 18

    [ -2, 1, DWConv, [ 128,  1, 1  ] ],
    [ -2, 1, DWConv, [ 256,  1, 1  ] ],
    [ [ -1,-2 ], 1, Detect, [ 3, anchors ] ], # nc=3
  ]

